---
kind: other
id: AllMembers.T:Autodesk.Revit.UI.SplitButton
source: html/930617fc-e786-44c7-0836-e188a0fba18d.htm
---
# SplitButton Members

Adds a new pushbutton to the pulldown button and associates it with an ExternalCommand.